#### `terraform plan` Success
<details><summary>Show Output</summary>

```
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/foreign-language-reader/infrastructure/runs/run-2LqAM6RjKFxioBWt

Waiting for the plan to start...

Terraform v0.14.3
Configuring remote state backend...
Initializing Terraform configuration...
module.infrastructure.tls_private_key.tls_private_key: Refreshing state... [id=96c5128d225c1725a7d5fda91c9f195dd1837181]
module.infrastructure.module.content.random_password.elasticsearch_password: Refreshing state... [id=none]
module.infrastructure.module.content.random_password.truststore_password: Refreshing state... [id=none]
digitalocean_kubernetes_cluster.foreign_language_reader: Refreshing state... [id=2132b4c2-fd9e-496c-8419-a39da7d142f0]
module.infrastructure.module.database.digitalocean_database_cluster.api_db: Refreshing state... [id=ea71992c-69be-4f47-aa38-20d9904d9c65]
module.infrastructure.module.api.random_password.elasticsearch_password: Refreshing state... [id=none]
module.infrastructure.digitalocean_domain.fluentlabs: Refreshing state... [id=fluentlabs.io]
module.infrastructure.digitalocean_domain.main: Refreshing state... [id=foreignlanguagereader.com]
module.infrastructure.module.api.random_password.application_secret: Refreshing state... [id=none]
module.infrastructure.acme_registration.reg: Refreshing state... [id=https://acme-v02.api.letsencrypt.org/acme/acct/106949055]
module.infrastructure.module.api.random_password.truststore_password: Refreshing state... [id=none]
module.infrastructure.module.monitoring.random_password.fluent_elasticsearch_password: Refreshing state... [id=none]
module.infrastructure.acme_certificate.certificate: Refreshing state... [id=https://acme-v02.api.letsencrypt.org/acme/cert/0473fc3cddaf1461c78ebf15ce5d034dc808]
module.infrastructure.acme_certificate.certificate_fluent_labs: Refreshing state... [id=https://acme-v02.api.letsencrypt.org/acme/cert/0423bb0e8dbb3575cf844a838c619b5a03db]
module.infrastructure.module.frontend_preprod.aws_s3_bucket.main: Refreshing state... [id=preprod.foreignlanguagereader.com]
module.infrastructure.module.elasticsearch.aws_iam_user.elasticsearch: Refreshing state... [id=elasticsearch]
module.infrastructure.module.elasticsearch.aws_s3_bucket.backup: Refreshing state... [id=foreign-language-reader-elasticsearch-backups]
module.infrastructure.module.content.aws_iam_user.spark: Refreshing state... [id=spark]
module.infrastructure.module.frontend.aws_s3_bucket.main: Refreshing state... [id=www.foreignlanguagereader.com]
module.infrastructure.module.content.aws_iam_user.github: Refreshing state... [id=github-spark-deploy]
module.infrastructure.aws_iam_user.github: Refreshing state... [id=foreign-language-reader-github]
module.infrastructure.module.content.aws_s3_bucket.content: Refreshing state... [id=foreign-language-reader-content]
module.infrastructure.module.api.digitalocean_database_db.api_database: Refreshing state... [id=ea71992c-69be-4f47-aa38-20d9904d9c65/database/foreign-language-reader-default]
module.infrastructure.module.api.digitalocean_database_user.api_user: Refreshing state... [id=ea71992c-69be-4f47-aa38-20d9904d9c65/user/api-default]
module.infrastructure.aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-west-2:037187302622:certificate/1c4a7bdd-2dce-4ff8-b5b5-2bf73e7c132d]
module.infrastructure.module.elasticsearch.aws_iam_access_key.elasticsearch: Refreshing state... [id=AKIAQRKEJGTPK4BHXIN6]
module.infrastructure.module.content.aws_iam_access_key.spark: Refreshing state... [id=AKIAQRKEJGTPARQC5JMK]
module.infrastructure.module.database.digitalocean_database_firewall.allow_kubernetes: Refreshing state... [id=ea71992c-69be-4f47-aa38-20d9904d9c65-20210110103039465500000001]
module.infrastructure.module.content.aws_iam_access_key.github: Refreshing state... [id=AKIAQRKEJGTPFPDKDIM2]
module.infrastructure.aws_iam_access_key.github: Refreshing state... [id=AKIAQRKEJGTPHZFIVEWW]
module.infrastructure.module.elasticsearch.helm_release.elasticsearch: Refreshing state... [id=elastic-operator]
module.infrastructure.module.content.helm_release.spark: Refreshing state... [id=spark]
module.infrastructure.module.nginx_ingress.helm_release.nginx_ingress: Refreshing state... [id=nginx-ingress]
module.infrastructure.module.monitoring.helm_release.prometheus_operator: Refreshing state... [id=prometheus]
module.infrastructure.module.monitoring.helm_release.fluentd_elasticsearch: Refreshing state... [id=fluentd]
module.infrastructure.module.api.kubernetes_secret.elasticsearch_credentials: Refreshing state... [id=default/elasticsearch-credentials]
module.infrastructure.module.elasticsearch.kubernetes_secret.elasticsearch_aws_credentials: Refreshing state... [id=default/elasticsearch-s3-creds]
module.infrastructure.module.api.kubernetes_horizontal_pod_autoscaler.api_autoscale: Refreshing state... [id=default/api]
module.infrastructure.module.content.kubernetes_secret.spark_config: Refreshing state... [id=default/spark-config]
module.infrastructure.module.language_service.kubernetes_service.language_service: Refreshing state... [id=default/language-service]
module.infrastructure.module.api.kubernetes_secret.application-secret: Refreshing state... [id=default/application-secret]
module.infrastructure.module.api.kubernetes_service.api: Refreshing state... [id=default/api]
module.infrastructure.module.elasticsearch.kubernetes_secret.elasticsearch_roles: Refreshing state... [id=default/elasticsearch-roles]
module.infrastructure.module.nginx_ingress.kubernetes_secret.nginx_certificate: Refreshing state... [id=default/nginx-certificate]
module.infrastructure.module.nginx_ingress.kubernetes_ingress.ingress: Refreshing state... [id=default/foreign-language-reader-ingress]
module.infrastructure.module.content.kubernetes_service_account.prefect_agent: Refreshing state... [id=default/prefect-agent]
module.infrastructure.module.language_service.kubernetes_horizontal_pod_autoscaler.language_service_autoscale: Refreshing state... [id=default/language-service]
module.infrastructure.module.content.kubernetes_role.prefect_agent: Refreshing state... [id=default/prefect-agent-rbac]
module.infrastructure.module.content.kubernetes_role_binding.prefect_agent: Refreshing state... [id=default/prefect-agent-rbac]
module.infrastructure.module.api.kubernetes_secret.api_database_credentials: Refreshing state... [id=default/api-database-credentials]
module.infrastructure.module.content.kubernetes_deployment.prefect: Refreshing state... [id=default/prefect-agent]
module.infrastructure.module.elasticsearch.digitalocean_record.elastic_subdomain_dns: Refreshing state... [id=128308864]
module.infrastructure.module.frontend_preprod.aws_s3_bucket_policy.public_access: Refreshing state... [id=preprod.foreignlanguagereader.com]
module.infrastructure.module.elasticsearch.digitalocean_record.kibana_subdomain_dns: Refreshing state... [id=128308865]
module.infrastructure.module.frontend_preprod.aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E3F8QDRJGU7DO0]
module.infrastructure.module.language_service.kubernetes_deployment.language_service: Refreshing state... [id=default/language-service]
module.infrastructure.module.frontend.aws_s3_bucket_policy.public_access: Refreshing state... [id=www.foreignlanguagereader.com]
module.infrastructure.module.frontend.aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E33TYMXRYMHHGW]
module.infrastructure.module.elasticsearch.aws_iam_policy.elasticsearch_backup: Refreshing state... [id=arn:aws:iam::037187302622:policy/elasticsearch-backup-role]
module.infrastructure.module.content.aws_iam_policy.spark_write: Refreshing state... [id=arn:aws:iam::037187302622:policy/spark-write-role]
module.infrastructure.module.content.aws_iam_policy.deploy: Refreshing state... [id=arn:aws:iam::037187302622:policy/spark-deploy-role]
module.infrastructure.module.content.aws_iam_policy.spark_read: Refreshing state... [id=arn:aws:iam::037187302622:policy/spark-read-role]
module.infrastructure.module.frontend.digitalocean_record.subdomain: Refreshing state... [id=127348003]
module.infrastructure.module.frontend_preprod.digitalocean_record.subdomain: Refreshing state... [id=135753207]
module.infrastructure.module.elasticsearch.elasticsearch_snapshot_repository.backups: Refreshing state... [id=S3-backup]
module.infrastructure.module.elasticsearch.elasticsearch_user.spark: Refreshing state... [id=spark]
module.infrastructure.module.elasticsearch.elasticsearch_user.fluentd: Refreshing state... [id=fluentd]
module.infrastructure.module.elasticsearch.elasticsearch_user.api: Refreshing state... [id=apiprod]
module.infrastructure.module.elasticsearch.aws_iam_policy_attachment.elasticsearch_backup: Refreshing state... [id=elasticsearch-backup-role-attach]
module.infrastructure.module.content.aws_iam_policy_attachment.deploy: Refreshing state... [id=spark-deploy-role-attach]
module.infrastructure.module.frontend_preprod.aws_iam_policy.deploy: Refreshing state... [id=arn:aws:iam::037187302622:policy/preprod.foreignlanguagereader.com-deploy-role]
module.infrastructure.module.content.aws_iam_policy_attachment.spark_write: Refreshing state... [id=spark-write-role-attach]
module.infrastructure.module.frontend.aws_iam_policy.deploy: Refreshing state... [id=arn:aws:iam::037187302622:policy/www.foreignlanguagereader.com-deploy-role]
module.infrastructure.module.content.aws_iam_policy_attachment.spark_read: Refreshing state... [id=spark-read-role-attach]
module.infrastructure.module.elasticsearch.elasticsearch_snapshot_lifecycle_policy.daily_backup: Refreshing state... [id=daily-snapshots]
module.infrastructure.module.frontend_preprod.aws_iam_policy_attachment.deploy: Refreshing state... [id=preprod.foreignlanguagereader.com-deploy-role-attach]
module.infrastructure.module.frontend.aws_iam_policy_attachment.deploy: Refreshing state... [id=www.foreignlanguagereader.com-deploy-role-attach]
module.infrastructure.module.api.kubernetes_deployment.api: Refreshing state... [id=default/api]
module.infrastructure.module.elasticsearch.elasticsearch_index_lifecycle_policy.rollover: Refreshing state... [id=logging-rollover]
module.infrastructure.module.elasticsearch.elasticsearch_index_template.fluentd: Refreshing state... [id=fluentd]
module.infrastructure.module.nginx_ingress.digitalocean_record.kubernetes_subdomain_dns["api"]: Refreshing state... [id=128302476]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.infrastructure.module.elasticsearch.elasticsearch_index_template.fluentd will be updated in-place
  ~ resource "elasticsearch_index_template" "fluentd" {
        id       = "fluentd"
        name     = "fluentd"
      ~ template = jsonencode(
          ~ {
              - fluentd        = {
                  - aliases        = {}
                  - index_patterns = [
                      - "logstash-*",
                    ]
                  - mappings       = {}
                  - order          = 0
                  - settings       = {
                      - index = {
                          - lifecycle = {
                              - name           = "logging-rollover"
                              - rollover_alias = "logstash-backup-alias"
                            }
                        }
                    }
                } -> null
              + index_patterns = [
                  + "logstash-*",
                ]
              + settings       = {
                  + index.lifecycle.name           = "logging-rollover"
                  + index.lifecycle.rollover_alias = "logstash-backup-alias"
                }
            }
        )
    }

  # module.infrastructure.module.frontend.data.aws_iam_policy_document.deploy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "deploy"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetBucketLocation",
              + "s3:GetObject",
              + "s3:ListBucket",
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::www.foreignlanguagereader.com/*",
            ]
        }
      + statement {
          + actions   = [
              + "cloudfront:CreateInvalidation",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:cloudfront::037187302622:distribution/E33TYMXRYMHHGW",
            ]
        }
    }

  # module.infrastructure.module.frontend.aws_cloudfront_distribution.s3_distribution will be updated in-place
  ~ resource "aws_cloudfront_distribution" "s3_distribution" {
        id                             = "E33TYMXRYMHHGW"
        tags                           = {}
        # (17 unchanged attributes hidden)




      ~ viewer_certificate {
          ~ acm_certificate_arn            = "arn:aws:acm:us-east-1:037187302622:certificate/23bf2e3d-1934-4470-a27d-05f3847a5ef2" -> "arn:aws:acm:us-west-2:037187302622:certificate/e4e49ac0-7134-486a-bdfd-e9809d227cef"
            # (3 unchanged attributes hidden)
        }
        # (3 unchanged blocks hidden)
    }

  # module.infrastructure.module.frontend.aws_iam_policy.deploy will be updated in-place
  ~ resource "aws_iam_policy" "deploy" {
        id          = "arn:aws:iam::037187302622:policy/www.foreignlanguagereader.com-deploy-role"
        name        = "www.foreignlanguagereader.com-deploy-role"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:ListBucket",
                          - "s3:GetObject",
                          - "s3:GetBucketLocation",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::www.foreignlanguagereader.com/*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "cloudfront:CreateInvalidation"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cloudfront::037187302622:distribution/E33TYMXRYMHHGW"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.infrastructure.module.frontend_fluent_labs.data.aws_iam_policy_document.deploy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "deploy"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetBucketLocation",
              + "s3:GetObject",
              + "s3:ListBucket",
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "cloudfront:CreateInvalidation",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.infrastructure.module.frontend_fluent_labs.aws_cloudfront_distribution.s3_distribution will be created
  + resource "aws_cloudfront_distribution" "s3_distribution" {
      + aliases                        = [
          + "www.fluentlabs.io",
        ]
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + default_root_object            = "index.html"
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = false
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_All"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + trusted_signers                = (known after apply)
      + wait_for_deployment            = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = 3600
          + max_ttl                = 86400
          + min_ttl                = 0
          + target_origin_id       = "www.fluentlabs.io"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + query_string = true

              + cookies {
                  + forward = "all"
                }
            }
        }

      + origin {
          + domain_name = (known after apply)
          + origin_id   = "www.fluentlabs.io"
        }

      + restrictions {
          + geo_restriction {
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = "arn:aws:acm:us-west-2:037187302622:certificate/1c4a7bdd-2dce-4ff8-b5b5-2bf73e7c132d"
          + minimum_protocol_version = "TLSv1"
          + ssl_support_method       = "sni-only"
        }
    }

  # module.infrastructure.module.frontend_fluent_labs.aws_iam_policy.deploy will be created
  + resource "aws_iam_policy" "deploy" {
      + arn         = (known after apply)
      + description = "IAM policy for deploying to www.fluentlabs.io"
      + id          = (known after apply)
      + name        = "www.fluentlabs.io-deploy-role"
      + path        = "/"
      + policy      = (known after apply)
    }

  # module.infrastructure.module.frontend_fluent_labs.aws_iam_policy_attachment.deploy will be created
  + resource "aws_iam_policy_attachment" "deploy" {
      + id         = (known after apply)
      + name       = "www.fluentlabs.io-deploy-role-attach"
      + policy_arn = (known after apply)
      + users      = [
          + "foreign-language-reader-github",
        ]
    }

  # module.infrastructure.module.frontend_fluent_labs.aws_s3_bucket.main will be created
  + resource "aws_s3_bucket" "main" {
      + acceleration_status         = (known after apply)
      + acl                         = "public-read"
      + arn                         = (known after apply)
      + bucket                      = "www.fluentlabs.io"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + error_document = "error.html"
          + index_document = "index.html"
        }
    }

  # module.infrastructure.module.frontend_fluent_labs.aws_s3_bucket_policy.public_access will be created
  + resource "aws_s3_bucket_policy" "public_access" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.infrastructure.module.frontend_fluent_labs.digitalocean_record.subdomain will be created
  + resource "digitalocean_record" "subdomain" {
      + domain = "fluentlabs.io"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "www"
      + ttl    = (known after apply)
      + type   = "CNAME"
      + value  = (known after apply)
    }

  # module.infrastructure.module.frontend_preprod.data.aws_iam_policy_document.deploy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "deploy"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetBucketLocation",
              + "s3:GetObject",
              + "s3:ListBucket",
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::preprod.foreignlanguagereader.com/*",
            ]
        }
      + statement {
          + actions   = [
              + "cloudfront:CreateInvalidation",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:cloudfront::037187302622:distribution/E3F8QDRJGU7DO0",
            ]
        }
    }

  # module.infrastructure.module.frontend_preprod.aws_cloudfront_distribution.s3_distribution will be updated in-place
  ~ resource "aws_cloudfront_distribution" "s3_distribution" {
        id                             = "E3F8QDRJGU7DO0"
        tags                           = {}
        # (17 unchanged attributes hidden)




      ~ viewer_certificate {
          ~ acm_certificate_arn            = "arn:aws:acm:us-east-1:037187302622:certificate/23bf2e3d-1934-4470-a27d-05f3847a5ef2" -> "arn:aws:acm:us-west-2:037187302622:certificate/e4e49ac0-7134-486a-bdfd-e9809d227cef"
            # (3 unchanged attributes hidden)
        }
        # (3 unchanged blocks hidden)
    }

  # module.infrastructure.module.frontend_preprod.aws_iam_policy.deploy will be updated in-place
  ~ resource "aws_iam_policy" "deploy" {
        id          = "arn:aws:iam::037187302622:policy/preprod.foreignlanguagereader.com-deploy-role"
        name        = "preprod.foreignlanguagereader.com-deploy-role"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:ListBucket",
                          - "s3:GetObject",
                          - "s3:GetBucketLocation",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::preprod.foreignlanguagereader.com/*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "cloudfront:CreateInvalidation"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cloudfront::037187302622:distribution/E3F8QDRJGU7DO0"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.infrastructure.module.frontend_preprod_fluent_labs.data.aws_iam_policy_document.deploy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "deploy"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetBucketLocation",
              + "s3:GetObject",
              + "s3:ListBucket",
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "cloudfront:CreateInvalidation",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.infrastructure.module.frontend_preprod_fluent_labs.aws_cloudfront_distribution.s3_distribution will be created
  + resource "aws_cloudfront_distribution" "s3_distribution" {
      + aliases                        = [
          + "preprod.fluentlabs.io",
        ]
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + default_root_object            = "index.html"
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = false
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_All"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + trusted_signers                = (known after apply)
      + wait_for_deployment            = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = 3600
          + max_ttl                = 86400
          + min_ttl                = 0
          + target_origin_id       = "preprod.fluentlabs.io"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + query_string = true

              + cookies {
                  + forward = "all"
                }
            }
        }

      + origin {
          + domain_name = (known after apply)
          + origin_id   = "preprod.fluentlabs.io"
        }

      + restrictions {
          + geo_restriction {
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = "arn:aws:acm:us-west-2:037187302622:certificate/1c4a7bdd-2dce-4ff8-b5b5-2bf73e7c132d"
          + minimum_protocol_version = "TLSv1"
          + ssl_support_method       = "sni-only"
        }
    }

  # module.infrastructure.module.frontend_preprod_fluent_labs.aws_iam_policy.deploy will be created
  + resource "aws_iam_policy" "deploy" {
      + arn         = (known after apply)
      + description = "IAM policy for deploying to preprod.fluentlabs.io"
      + id          = (known after apply)
      + name        = "preprod.fluentlabs.io-deploy-role"
      + path        = "/"
      + policy      = (known after apply)
    }

  # module.infrastructure.module.frontend_preprod_fluent_labs.aws_iam_policy_attachment.deploy will be created
  + resource "aws_iam_policy_attachment" "deploy" {
      + id         = (known after apply)
      + name       = "preprod.fluentlabs.io-deploy-role-attach"
      + policy_arn = (known after apply)
      + users      = [
          + "foreign-language-reader-github",
        ]
    }

  # module.infrastructure.module.frontend_preprod_fluent_labs.aws_s3_bucket.main will be created
  + resource "aws_s3_bucket" "main" {
      + acceleration_status         = (known after apply)
      + acl                         = "public-read"
      + arn                         = (known after apply)
      + bucket                      = "preprod.fluentlabs.io"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + error_document = "error.html"
          + index_document = "index.html"
        }
    }

  # module.infrastructure.module.frontend_preprod_fluent_labs.aws_s3_bucket_policy.public_access will be created
  + resource "aws_s3_bucket_policy" "public_access" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.infrastructure.module.frontend_preprod_fluent_labs.digitalocean_record.subdomain will be created
  + resource "digitalocean_record" "subdomain" {
      + domain = "fluentlabs.io"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "preprod"
      + ttl    = (known after apply)
      + type   = "CNAME"
      + value  = (known after apply)
    }

Plan: 12 to add, 5 to change, 0 to destroy.

Warning: Release does not exist

Release name: spark does not exist. It may have been deleted outside of
Terraform

```

</details>

*Workflow: `Test infrastructure plan`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`, Workspace: `default`*
